GreatCowBASIC/DATFileGenerator/incfiles/p18lf25k42.inc
        LIST

;==========================================================================
; Build date : Oct 24 2019
;  MPASM PIC18LF25K42 processor include
; 
;  (c) Copyright 1999-2019 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18LF25K42 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18LF25K42
;       2. LIST directive in the source file
;               LIST   P=PIC18LF25K42
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18LF25K42
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
STATUS_CSHAD     EQU  H'3880'
WREG_CSHAD       EQU  H'3881'
BSR_CSHAD        EQU  H'3882'
SHADCON          EQU  H'3883'
STATUS_SHAD      EQU  H'3884'
WREG_SHAD        EQU  H'3885'
BSR_SHAD         EQU  H'3886'
PCLATH_SHAD      EQU  H'3887'
PCLATU_SHAD      EQU  H'3888'
FSR0L_SHAD       EQU  H'3889'
FSR0SH           EQU  H'3889'
FSR0H_SHAD       EQU  H'388A'
FSR1L_SHAD       EQU  H'388B'
FSR1SH           EQU  H'388B'
FSR1H_SHAD       EQU  H'388C'
FSR2L_SHAD       EQU  H'388D'
FSR2SH           EQU  H'388D'
FSR2H_SHAD       EQU  H'388E'
PRODL_SHAD       EQU  H'388F'
PRODSH           EQU  H'388F'
PRODH_SHAD       EQU  H'3890'
IVTADL           EQU  H'389D'
IVTADH           EQU  H'389E'
IVTADU           EQU  H'389F'
WDTCON0          EQU  H'395B'
WDTCON1          EQU  H'395C'
WDTPSL           EQU  H'395D'
WDTPSH           EQU  H'395E'
WDTTMR           EQU  H'395F'
CRCDATA          EQU  H'3960'
CRCDATL          EQU  H'3960'
CRCDATH          EQU  H'3961'
CRCACC           EQU  H'3962'
CRCACCL          EQU  H'3962'
CRCACCH          EQU  H'3963'
CRCSHFT          EQU  H'3964'
CRCSHIFTL        EQU  H'3964'
CRCSHIFTH        EQU  H'3965'
CRCXOR           EQU  H'3966'
CRCXORL          EQU  H'3966'
CRCXORH          EQU  H'3967'
CRCCON0          EQU  H'3968'
CRCCON1          EQU  H'3969'
SCANLADR         EQU  H'3976'
SCANLADRL        EQU  H'3976'
SCANLADRH        EQU  H'3977'
SCANLADRU        EQU  H'3978'
SCANHADR         EQU  H'3979'
SCANHADRL        EQU  H'3979'
SCANHADRH        EQU  H'397A'
SCANHADRU        EQU  H'397B'
SCANCON0         EQU  H'397C'
SCANTRIG         EQU  H'397D'
IPR0             EQU  H'3980'
IPR1             EQU  H'3981'
IPR2             EQU  H'3982'
IPR3             EQU  H'3983'
IPR4             EQU  H'3984'
IPR5             EQU  H'3985'
IPR6             EQU  H'3986'
IPR7             EQU  H'3987'
IPR8             EQU  H'3988'
IPR9             EQU  H'3989'
IPR10            EQU  H'398A'
PIE0             EQU  H'3990'
PIE1             EQU  H'3991'
PIE2             EQU  H'3992'
PIE3             EQU  H'3993'
PIE4             EQU  H'3994'
PIE5             EQU  H'3995'
PIE6             EQU  H'3996'
PIE7             EQU  H'3997'
PIE8             EQU  H'3998'
PIE9             EQU  H'3999'
PIE10            EQU  H'399A'
PIR0             EQU  H'39A0'
PIR1             EQU  H'39A1'
PIR2             EQU  H'39A2'
PIR3             EQU  H'39A3'
PIR4             EQU  H'39A4'
PIR5             EQU  H'39A5'
PIR6             EQU  H'39A6'
PIR7             EQU  H'39A7'
PIR8             EQU  H'39A8'
PIR9             EQU  H'39A9'
PIR10            EQU  H'39AA'
PMD0             EQU  H'39C0'
PMD1             EQU  H'39C1'
PMD2             EQU  H'39C2'
PMD3             EQU  H'39C3'
PMD4             EQU  H'39C4'
PMD5             EQU  H'39C5'
PMD6             EQU  H'39C6'
PMD7             EQU  H'39C7'
BORCON           EQU  H'39D0'
CPUDOZE          EQU  H'39D8'
OSCCON1          EQU  H'39D9'
OSCCON2          EQU  H'39DA'
OSCCON3          EQU  H'39DB'
OSCSTAT          EQU  H'39DC'
OSCSTAT1         EQU  H'39DC'
OSCEN            EQU  H'39DD'
OSCTUNE          EQU  H'39DE'
OSCFRQ           EQU  H'39DF'
NVMADRL          EQU  H'39E0'
NVMDAT           EQU  H'39E3'
NVMCON1          EQU  H'39E5'
NVMCON2          EQU  H'39E6'
PRLOCK           EQU  H'39EF'
ISRPR            EQU  H'39F1'
MAINPR           EQU  H'39F2'
DMA1PR           EQU  H'39F3'
DMA2PR           EQU  H'39F4'
SCANPR           EQU  H'39F7'
RA0PPS           EQU  H'3A00'
RA1PPS           EQU  H'3A01'
RA2PPS           EQU  H'3A02'
RA3PPS           EQU  H'3A03'
RA4PPS           EQU  H'3A04'
RA5PPS           EQU  H'3A05'
RA6PPS           EQU  H'3A06'
RA7PPS           EQU  H'3A07'
RB0PPS           EQU  H'3A08'
RB1PPS           EQU  H'3A09'
RB2PPS           EQU  H'3A0A'
RB3PPS           EQU  H'3A0B'
RB4PPS           EQU  H'3A0C'
RB5PPS           EQU  H'3A0D'
RB6PPS           EQU  H'3A0E'
RB7PPS           EQU  H'3A0F'
RC0PPS           EQU  H'3A10'
RC1PPS           EQU  H'3A11'
RC2PPS           EQU  H'3A12'
RC3PPS           EQU  H'3A13'
RC4PPS           EQU  H'3A14'
RC5PPS           EQU  H'3A15'
RC6PPS           EQU  H'3A16'
RC7PPS           EQU  H'3A17'
ANSELA           EQU  H'3A40'
WPUA             EQU  H'3A41'
ODCONA           EQU  H'3A42'
SLRCONA          EQU  H'3A43'
INLVLA           EQU  H'3A44'
IOCAP            EQU  H'3A45'
IOCAN            EQU  H'3A46'
IOCAF            EQU  H'3A47'
CCDPA            EQU  H'3A48'
CCDNA            EQU  H'3A49'
ANSELB           EQU  H'3A50'
WPUB             EQU  H'3A51'
ODCONB           EQU  H'3A52'
SLRCONB          EQU  H'3A53'
INLVLB           EQU  H'3A54'
IOCBP            EQU  H'3A55'
IOCBN            EQU  H'3A56'
IOCBF            EQU  H'3A57'
CCDPB            EQU  H'3A58'
CCDNB            EQU  H'3A59'
RB1I2C           EQU  H'3A5A'
RB2I2C           EQU  H'3A5B'
ANSELC           EQU  H'3A60'
WPUC             EQU  H'3A61'
ODCONC           EQU  H'3A62'
SLRCONC          EQU  H'3A63'
INLVLC           EQU  H'3A64'
IOCCP            EQU  H'3A65'
IOCCN            EQU  H'3A66'
IOCCF            EQU  H'3A67'
CCDPC            EQU  H'3A68'
CCDNC            EQU  H'3A69'
RC3I2C           EQU  H'3A6A'
RC4I2C           EQU  H'3A6B'
WPUE             EQU  H'3A81'
INLVLE           EQU  H'3A84'
IOCEP            EQU  H'3A85'
IOCEN            EQU  H'3A86'
IOCEF            EQU  H'3A87'
CCDCON           EQU  H'3ABE'
PPSLOCK          EQU  H'3ABF'
INT0PPS          EQU  H'3AC0'
INT1PPS          EQU  H'3AC1'
INT2PPS          EQU  H'3AC2'
T0CKIPPS         EQU  H'3AC3'
T1CKIPPS         EQU  H'3AC4'
T1GPPS           EQU  H'3AC5'
T3CKIPPS         EQU  H'3AC6'
T3GPPS           EQU  H'3AC7'
T5CKIPPS         EQU  H'3AC8'
T5GPPS           EQU  H'3AC9'
T2INPPS          EQU  H'3ACA'
T4INPPS          EQU  H'3ACB'
T6INPPS          EQU  H'3ACC'
CCP1PPS          EQU  H'3ACD'
CCP2PPS          EQU  H'3ACE'
CCP3PPS          EQU  H'3ACF'
CCP4PPS          EQU  H'3AD0'
SMT1WINPPS       EQU  H'3AD1'
SMT1SIGPPS       EQU  H'3AD2'
CWG1INPPS        EQU  H'3AD3'
CWG2INPPS        EQU  H'3AD4'
CWG3INPPS        EQU  H'3AD5'
MD1CARLPPS       EQU  H'3AD6'
MD1CARHPPS       EQU  H'3AD7'
MD1SRCPPS        EQU  H'3AD8'
CLCIN0PPS        EQU  H'3AD9'
CLCIN1PPS        EQU  H'3ADA'
CLCIN2PPS        EQU  H'3ADB'
CLCIN3PPS        EQU  H'3ADC'
ADACTPPS         EQU  H'3ADD'
SPI1SCKPPS       EQU  H'3ADE'
SPI1SDIPPS       EQU  H'3ADF'
SPI1SSPPS        EQU  H'3AE0'
I2C1SCLPPS       EQU  H'3AE1'
I2C1SDAPPS       EQU  H'3AE2'
I2C2SCLPPS       EQU  H'3AE3'
I2C2SDAPPS       EQU  H'3AE4'
U1RXPPS          EQU  H'3AE5'
U1CTSPPS         EQU  H'3AE6'
U2RXPPS          EQU  H'3AE8'
U2CTSPPS         EQU  H'3AE9'
DMA2BUF          EQU  H'3BC9'
DMA2DCNT         EQU  H'3BCA'
DMA2DCNTL        EQU  H'3BCA'
DMA2DCNTH        EQU  H'3BCB'
DMA2DPTR         EQU  H'3BCC'
DMA2DPTRL        EQU  H'3BCC'
DMA2DPTRH        EQU  H'3BCD'
DMA2DSZ          EQU  H'3BCE'
DMA2DSZL         EQU  H'3BCE'
DMA2DSZH         EQU  H'3BCF'
DMA2DSA          EQU  H'3BD0'
DMA2DSAL         EQU  H'3BD0'
DMA2DSAH         EQU  H'3BD1'
DMA2SCNT         EQU  H'3BD2'
DMA2SCNTL        EQU  H'3BD2'
DMA2SCNTH        EQU  H'3BD3'
DMA2SPTR         EQU  H'3BD4'
DMA2SPTRL        EQU  H'3BD4'
DMA2SPTRH        EQU  H'3BD5'
DMA2SPTRU        EQU  H'3BD6'
DMA2SSZ          EQU  H'3BD7'
DMA2SSZL         EQU  H'3BD7'
DMA2SSZH         EQU  H'3BD8'
DMA2SSA          EQU  H'3BD9'
DMA2SSAL         EQU  H'3BD9'
DMA2SSAH         EQU  H'3BDA'
DMA2SSAU         EQU  H'3BDB'
DMA2CON0         EQU  H'3BDC'
DMA2CON1         EQU  H'3BDD'
DMA2AIRQ         EQU  H'3BDE'
DMA2SIRQ         EQU  H'3BDF'
DMA1BUF          EQU  H'3BE9'
DMA1DCNT         EQU  H'3BEA'
DMA1DCNTL        EQU  H'3BEA'
DMA1DCNTH        EQU  H'3BEB'
DMA1DPTR         EQU  H'3BEC'
DMA1DPTRL        EQU  H'3BEC'
DMA1DPTRH        EQU  H'3BED'
DMA1DSZ          EQU  H'3BEE'
DMA1DSZL         EQU  H'3BEE'
DMA1DSZH         EQU  H'3BEF'
DMA1DSA          EQU  H'3BF0'
DMA1DSAL         EQU  H'3BF0'
DMA1DSAH         EQU  H'3BF1'
DMA1SCNT         EQU  H'3BF2'
DMA1SCNTL        EQU  H'3BF2'
DMA1SCNTH        EQU  H'3BF3'
DMA1SPTR         EQU  H'3BF4'
DMA1SPTRL        EQU  H'3BF4'
DMA1SPTRH        EQU  H'3BF5'
DMA1SPTRU        EQU  H'3BF6'
DMA1SSZ          EQU  H'3BF7'
DMA1SSZL         EQU  H'3BF7'
DMA1SSZH         EQU  H'3BF8'
DMA1SSA          EQU  H'3BF9'
DMA1SSAL         EQU  H'3BF9'
DMA1SSAH         EQU  H'3BFA'
DMA1SSAU         EQU  H'3BFB'
DMA1CON0         EQU  H'3BFC'
DMA1CON1         EQU  H'3BFD'
DMA1AIRQ         EQU  H'3BFE'
DMA1SIRQ         EQU  H'3BFF'
CLC4CON          EQU  H'3C56'
CLC4POL          EQU  H'3C57'
CLC4SEL0         EQU  H'3C58'
CLC4SEL1         EQU  H'3C59'
CLC4SEL2         EQU  H'3C5A'
CLC4SEL3         EQU  H'3C5B'
CLC4GLS0         EQU  H'3C5C'
CLC4GLS1         EQU  H'3C5D'
CLC4GLS2         EQU  H'3C5E'
CLC4GLS3         EQU  H'3C5F'
CLC3CON          EQU  H'3C60'
CLC3POL          EQU  H'3C61'
CLC3SEL0         EQU  H'3C62'
CLC3SEL1         EQU  H'3C63'
CLC3SEL2         EQU  H'3C64'
CLC3SEL3         EQU  H'3C65'
CLC3GLS0         EQU  H'3C66'
CLC3GLS1         EQU  H'3C67'
CLC3GLS2         EQU  H'3C68'
CLC3GLS3         EQU  H'3C69'
CLC2CON          EQU  H'3C6A'
CLC2POL          EQU  H'3C6B'
CLC2SEL0         EQU  H'3C6C'
CLC2SEL1         EQU  H'3C6D'
CLC2SEL2         EQU  H'3C6E'
CLC2SEL3         EQU  H'3C6F'
CLC2GLS0         EQU  H'3C70'
CLC2GLS1         EQU  H'3C71'
CLC2GLS2         EQU  H'3C72'
CLC2GLS3         EQU  H'3C73'
CLC1CON          EQU  H'3C74'
CLC1POL          EQU  H'3C75'
CLC1SEL0         EQU  H'3C76'
CLC1SEL1         EQU  H'3C77'
CLC1SEL2         EQU  H'3C78'
CLC1SEL3         EQU  H'3C79'
CLC1GLS0         EQU  H'3C7A'
CLC1GLS1         EQU  H'3C7B'
CLC1GLS2         EQU  H'3C7C'
CLC1GLS3         EQU  H'3C7D'
CLCDATA0         EQU  H'3C7E'
CLKRCON          EQU  H'3CE5'
CLKRCLK          EQU  H'3CE6'
MD1CON0          EQU  H'3CFA'
MD1CON1          EQU  H'3CFB'
MD1SRC           EQU  H'3CFC'
MD1CARL          EQU  H'3CFD'
MD1CARH          EQU  H'3CFE'
SPI1RXB          EQU  H'3D10'
SPI1TXB          EQU  H'3D11'
SPI1TCNT         EQU  H'3D12'
SPI1TCNTL        EQU  H'3D12'
SPI1TCNTH        EQU  H'3D13'
SPI1CON0         EQU  H'3D14'
SPI1CON1         EQU  H'3D15'
SPI1CON2         EQU  H'3D16'
SPI1STATUS       EQU  H'3D17'
SPI1TWIDTH       EQU  H'3D18'
SPI1BAUD         EQU  H'3D19'
SPI1INTF         EQU  H'3D1A'
SPI1INTE         EQU  H'3D1B'
SPI1CLK          EQU  H'3D1C'
I2C2RXB          EQU  H'3D54'
I2C2TXB          EQU  H'3D55'
I2C2CNT          EQU  H'3D56'
I2C2ADB0         EQU  H'3D57'
I2C2ADB1         EQU  H'3D58'
I2C2ADR0         EQU  H'3D59'
I2C2ADR1         EQU  H'3D5A'
I2C2ADR2         EQU  H'3D5B'
I2C2ADR3         EQU  H'3D5C'
I2C2CON0         EQU  H'3D5D'
I2C2CON1         EQU  H'3D5E'
I2C2CON2         EQU  H'3D5F'
I2C2ERR          EQU  H'3D60'
I2C2STAT0        EQU  H'3D61'
I2C2STAT1        EQU  H'3D62'
I2C2PIR          EQU  H'3D63'
I2C2PIE          EQU  H'3D64'
I2C2CLK          EQU  H'3D65'
I2C2BTO          EQU  H'3D66'
I2C1RXB          EQU  H'3D6A'
I2C1TXB          EQU  H'3D6B'
I2C1CNT          EQU  H'3D6C'
I2C1ADB0         EQU  H'3D6D'
I2C1ADB1         EQU  H'3D6E'
I2C1ADR0         EQU  H'3D6F'
I2C1ADR1         EQU  H'3D70'
I2C1ADR2         EQU  H'3D71'
I2C1ADR3         EQU  H'3D72'
I2C1CON0         EQU  H'3D73'
I2C1CON1         EQU  H'3D74'
I2C1CON2         EQU  H'3D75'
I2C1ERR          EQU  H'3D76'
I2C1STAT0        EQU  H'3D77'
I2C1STAT1        EQU  H'3D78'
I2C1PIR          EQU  H'3D79'
I2C1PIE          EQU  H'3D7A'
I2C1CLK          EQU  H'3D7B'
I2C1BTO          EQU  H'3D7C'
U2RXB            EQU  H'3DD0'
U2RXBL           EQU  H'3DD0'
U2TXB            EQU  H'3DD2'
U2TXBL           EQU  H'3DD2'
U2P1             EQU  H'3DD4'
U2P1L            EQU  H'3DD4'
U2P2             EQU  H'3DD6'
U2P2L            EQU  H'3DD6'
U2P3             EQU  H'3DD8'
U2P3L            EQU  H'3DD8'
U2CON0           EQU  H'3DDA'
U2CON1           EQU  H'3DDB'
U2CON2           EQU  H'3DDC'
U2BRG            EQU  H'3DDD'
U2BRGL           EQU  H'3DDD'
U2BRGH           EQU  H'3DDE'
U2FIFO           EQU  H'3DDF'
U2UIR            EQU  H'3DE0'
U2ERRIR          EQU  H'3DE1'
U2ERRIE          EQU  H'3DE2'
U1RXB            EQU  H'3DE8'
U1RXBL           EQU  H'3DE8'
U1RXCHK          EQU  H'3DE9'
U1TXB            EQU  H'3DEA'
U1TXBL           EQU  H'3DEA'
U1TXCHK          EQU  H'3DEB'
U1P1             EQU  H'3DEC'
U1P1L            EQU  H'3DEC'
U1P1H            EQU  H'3DED'
U1P2             EQU  H'3DEE'
U1P2L            EQU  H'3DEE'
U1P2H            EQU  H'3DEF'
U1P3             EQU  H'3DF0'
U1P3L            EQU  H'3DF0'
U1P3H            EQU  H'3DF1'
U1CON0           EQU  H'3DF2'
U1CON1           EQU  H'3DF3'
U1CON2           EQU  H'3DF4'
U1BRG            EQU  H'3DF5'
U1BRGL           EQU  H'3DF5'
U1BRGH           EQU  H'3DF6'
U1FIFO           EQU  H'3DF7'
U1UIR            EQU  H'3DF8'
U1ERRIR          EQU  H'3DF9'
U1ERRIE          EQU  H'3DFA'
DAC1CON1         EQU  H'3E9C'
DAC1CON0         EQU  H'3E9E'
CM2CON0          EQU  H'3EB8'
CM2CON1          EQU  H'3EB9'
CM2NCH           EQU  H'3EBA'
CM2PCH           EQU  H'3EBB'
CM1CON0          EQU  H'3EBC'
CM1CON1          EQU  H'3EBD'
CM1NCH           EQU  H'3EBE'
CM1PCH           EQU  H'3EBF'
CMOUT            EQU  H'3EC0'
FVRCON           EQU  H'3EC1'
ZCDCON           EQU  H'3EC3'
HLVDCON0         EQU  H'3EC9'
HLVDCON1         EQU  H'3ECA'
ADCP             EQU  H'3ED7'
ADLTH            EQU  H'3EDE'
ADLTHL           EQU  H'3EDE'
ADLTHH           EQU  H'3EDF'
ADUTH            EQU  H'3EE0'
ADUTHL           EQU  H'3EE0'
ADUTHH           EQU  H'3EE1'
ADERR            EQU  H'3EE2'
ADERRL           EQU  H'3EE2'
ADERRH           EQU  H'3EE3'
ADSTPT           EQU  H'3EE4'
ADSTPTL          EQU  H'3EE4'
ADSTPTH          EQU  H'3EE5'
ADFLTR           EQU  H'3EE6'
ADFLTRL          EQU  H'3EE6'
ADFLTRH          EQU  H'3EE7'
ADACC            EQU  H'3EE8'
ADACCL           EQU  H'3EE8'
ADACCH           EQU  H'3EE9'
ADACCU           EQU  H'3EEA'
ADCNT            EQU  H'3EEB'
ADRPT            EQU  H'3EEC'
ADPREV           EQU  H'3EED'
ADPREVL          EQU  H'3EED'
ADPREVH          EQU  H'3EEE'
ADRES            EQU  H'3EEF'
ADRESL           EQU  H'3EEF'
ADRESH           EQU  H'3EF0'
ADPCH            EQU  H'3EF1'
ADACQ            EQU  H'3EF3'
ADACQL           EQU  H'3EF3'
ADACQH           EQU  H'3EF4'
ADCAP            EQU  H'3EF5'
ADPRE            EQU  H'3EF6'
ADPREL           EQU  H'3EF6'
ADPREH           EQU  H'3EF7'
ADCON0           EQU  H'3EF8'
ADCON1           EQU  H'3EF9'
ADCON2           EQU  H'3EFA'
ADCON3           EQU  H'3EFB'
ADSTAT           EQU  H'3EFC'
ADREF            EQU  H'3EFD'
ADACT            EQU  H'3EFE'
ADCLK            EQU  H'3EFF'
SMT1TMR          EQU  H'3F12'
SMT1TMRL         EQU  H'3F12'
SMT1TMRH         EQU  H'3F13'
SMT1TMRU         EQU  H'3F14'
SMT1CPR          EQU  H'3F15'
SMT1CPRL         EQU  H'3F15'
SMT1CPRH         EQU  H'3F16'
SMT1CPRU         EQU  H'3F17'
SMT1CPW          EQU  H'3F18'
SMT1CPWL         EQU  H'3F18'
SMT1CPWH         EQU  H'3F19'
SMT1CPWU         EQU  H'3F1A'
SMT1PR           EQU  H'3F1B'
SMT1PRL          EQU  H'3F1B'
SMT1PRH          EQU  H'3F1C'
SMT1PRU          EQU  H'3F1D'
SMT1CON0         EQU  H'3F1E'
SMT1CON1         EQU  H'3F1F'
SMT1STAT         EQU  H'3F20'
SMT1CLK          EQU  H'3F21'
SMT1SIG          EQU  H'3F22'
SMT1WIN          EQU  H'3F23'
NCO1ACC          EQU  H'3F38'
NCO1ACCL         EQU  H'3F38'
NCO1ACCH         EQU  H'3F39'
NCO1ACCU         EQU  H'3F3A'
NCO1INC          EQU  H'3F3B'
NCO1INCL         EQU  H'3F3B'
NCO1INCH         EQU  H'3F3C'
NCO1INCU         EQU  H'3F3D'
NCO1CON          EQU  H'3F3E'
NCO1CLK          EQU  H'3F3F'
CWG3CLK          EQU  H'3F40'
CWG3CLKCON       EQU  H'3F40'
CWG3ISM          EQU  H'3F41'
CWG3DBR          EQU  H'3F42'
CWG3DBF          EQU  H'3F43'
CWG3CON0         EQU  H'3F44'
CWG3CON1         EQU  H'3F45'
CWG3AS0          EQU  H'3F46'
CWG3AS1          EQU  H'3F47'
CWG3STR          EQU  H'3F48'
CWG2CLK          EQU  H'3F49'
CWG2CLKCON       EQU  H'3F49'
CWG2ISM          EQU  H'3F4A'
CWG2DBR          EQU  H'3F4B'
CWG2DBF          EQU  H'3F4C'
CWG2CON0         EQU  H'3F4D'
CWG2CON1         EQU  H'3F4E'
CWG2AS0          EQU  H'3F4F'
CWG2AS1          EQU  H'3F50'
CWG2STR          EQU  H'3F51'
CWG1CLK          EQU  H'3F52'
CWG1CLKCON       EQU  H'3F52'
CWG1ISM          EQU  H'3F53'
CWG1DBR          EQU  H'3F54'
CWG1DBF          EQU  H'3F55'
CWG1CON0         EQU  H'3F56'
CWG1CON1         EQU  H'3F57'
CWG1AS0          EQU  H'3F58'
CWG1AS1          EQU  H'3F59'
CWG1STR          EQU  H'3F5A'
CCPTMRS0         EQU  H'3F5E'
CCPTMRS1         EQU  H'3F5F'
PWM8DC           EQU  H'3F60'
PWM8DCL          EQU  H'3F60'
PWM8DCH          EQU  H'3F61'
PWM8CON          EQU  H'3F62'
PWM7DC           EQU  H'3F64'
PWM7DCL          EQU  H'3F64'
PWM7DCH          EQU  H'3F65'
PWM7CON          EQU  H'3F66'
PWM6DC           EQU  H'3F68'
PWM6DCL          EQU  H'3F68'
PWM6DCH          EQU  H'3F69'
PWM6CON          EQU  H'3F6A'
PWM5DC           EQU  H'3F6C'
PWM5DCL          EQU  H'3F6C'
PWM5DCH          EQU  H'3F6D'
PWM5CON          EQU  H'3F6E'
CCPR4            EQU  H'3F70'
CCPR4L           EQU  H'3F70'
CCPR4H           EQU  H'3F71'
CCP4CON          EQU  H'3F72'
CCP4CAP          EQU  H'3F73'
CCPR3            EQU  H'3F74'
CCPR3L           EQU  H'3F74'
CCPR3H           EQU  H'3F75'
CCP3CON          EQU  H'3F76'
CCP3CAP          EQU  H'3F77'
CCPR2            EQU  H'3F78'
CCPR2L           EQU  H'3F78'
CCPR2H           EQU  H'3F79'
CCP2CON          EQU  H'3F7A'
CCP2CAP          EQU  H'3F7B'
CCPR1            EQU  H'3F7C'
CCPR1L           EQU  H'3F7C'
CCPR1H           EQU  H'3F7D'
CCP1CON          EQU  H'3F7E'
CCP1CAP          EQU  H'3F7F'
T6TMR            EQU  H'3F92'
TMR6             EQU  H'3F92'
PR6              EQU  H'3F93'
T6PR             EQU  H'3F93'
T6CON            EQU  H'3F94'
T6HLT            EQU  H'3F95'
T6CLK            EQU  H'3F96'
T6CLKCON         EQU  H'3F96'
T6RST            EQU  H'3F97'
TMR5L            EQU  H'3F98'
TMR5H            EQU  H'3F99'
T5CON            EQU  H'3F9A'
TMR5CON          EQU  H'3F9A'
T5GCON           EQU  H'3F9B'
TMR5GCON         EQU  H'3F9B'
T5GATE           EQU  H'3F9C'
TMR5GATE         EQU  H'3F9C'
T5CLK            EQU  H'3F9D'
TMR5CLK          EQU  H'3F9D'
T4TMR            EQU  H'3F9E'
TMR4             EQU  H'3F9E'
PR4              EQU  H'3F9F'
T4PR             EQU  H'3F9F'
T4CON            EQU  H'3FA0'
T4HLT            EQU  H'3FA1'
T4CLK            EQU  H'3FA2'
T4CLKCON         EQU  H'3FA2'
T4RST            EQU  H'3FA3'
TMR3L            EQU  H'3FA4'
TMR3H            EQU  H'3FA5'
T3CON            EQU  H'3FA6'
TMR3CON          EQU  H'3FA6'
T3GCON           EQU  H'3FA7'
TMR3GCON         EQU  H'3FA7'
T3GATE           EQU  H'3FA8'
TMR3GATE         EQU  H'3FA8'
T3CLK            EQU  H'3FA9'
TMR3CLK          EQU  H'3FA9'
T2TMR            EQU  H'3FAA'
TMR2             EQU  H'3FAA'
PR2              EQU  H'3FAB'
T2PR             EQU  H'3FAB'
T2CON            EQU  H'3FAC'
T2HLT            EQU  H'3FAD'
T2CLK            EQU  H'3FAE'
T2CLKCON         EQU  H'3FAE'
T2RST            EQU  H'3FAF'
TMR1L            EQU  H'3FB0'
TMR1H            EQU  H'3FB1'
T1CON            EQU  H'3FB2'
TMR1CON          EQU  H'3FB2'
T1GCON           EQU  H'3FB3'
TMR1GCON         EQU  H'3FB3'
T1GATE           EQU  H'3FB4'
TMR1GATE         EQU  H'3FB4'
T1CLK            EQU  H'3FB5'
TMR1CLK          EQU  H'3FB5'
TMR0             EQU  H'3FB6'
TMR0L            EQU  H'3FB6'
PR0              EQU  H'3FB7'
TMR0H            EQU  H'3FB7'
T0CON0           EQU  H'3FB8'
T0CON1           EQU  H'3FB9'
LATA             EQU  H'3FBA'
LATB             EQU  H'3FBB'
LATC             EQU  H'3FBC'
TRISA            EQU  H'3FC2'
TRISB            EQU  H'3FC3'
TRISC            EQU  H'3FC4'
PORTA            EQU  H'3FCA'
PORTB            EQU  H'3FCB'
PORTC            EQU  H'3FCC'
PORTE            EQU  H'3FCE'
INTCON0          EQU  H'3FD2'
INTCON1          EQU  H'3FD3'
IVTLOCK          EQU  H'3FD4'
IVTBASE          EQU  H'3FD5'
IVTBASEL         EQU  H'3FD5'
IVTBASEH         EQU  H'3FD6'
IVTBASEU         EQU  H'3FD7'
STATUS           EQU  H'3FD8'
FSR2L            EQU  H'3FD9'
FSR2H            EQU  H'3FDA'
PLUSW2           EQU  H'3FDB'
PREINC2          EQU  H'3FDC'
POSTDEC2         EQU  H'3FDD'
POSTINC2         EQU  H'3FDE'
INDF2            EQU  H'3FDF'
BSR              EQU  H'3FE0'
FSR1L            EQU  H'3FE1'
FSR1H            EQU  H'3FE2'
PLUSW1           EQU  H'3FE3'
PREINC1          EQU  H'3FE4'
POSTDEC1         EQU  H'3FE5'
POSTINC1         EQU  H'3FE6'
INDF1            EQU  H'3FE7'
WREG             EQU  H'3FE8'
FSR0L            EQU  H'3FE9'
FSR0H            EQU  H'3FEA'
PLUSW0           EQU  H'3FEB'
PREINC0          EQU  H'3FEC'
POSTDEC0         EQU  H'3FED'
