GreatCowBASIC/DATFileGenerator/incfiles/p18lf25k42.inc
;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
HLVDIE           EQU  H'0001'
OSFIE            EQU  H'0002'
CSWIE            EQU  H'0003'
NVMIE            EQU  H'0004'
SCANIE           EQU  H'0005'
CRCIE            EQU  H'0006'
IOCIE            EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
DMA1SCNTIE       EQU  H'0000'
DMA1DCNTIE       EQU  H'0001'
DMA1ORIE         EQU  H'0002'
DMA1AIE          EQU  H'0003'
SPI1RXIE         EQU  H'0004'
SPI1TXIE         EQU  H'0005'
SPI1IE           EQU  H'0006'
I2C1RXIE         EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
I2C1TXIE         EQU  H'0000'
I2C1IE           EQU  H'0001'
I2C1EIE          EQU  H'0002'
U1RXIE           EQU  H'0003'
U1TXIE           EQU  H'0004'
U1EIE            EQU  H'0005'
U1IE             EQU  H'0006'
TMR0IE           EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
TMR1IE           EQU  H'0000'
TMR1GIE          EQU  H'0001'
TMR2IE           EQU  H'0002'
CCP1IE           EQU  H'0003'
NCO1IE           EQU  H'0005'
CWG1IE           EQU  H'0006'
CLC1IE           EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
INT1IE           EQU  H'0000'
C2IE             EQU  H'0001'
DMA2SCNTIE       EQU  H'0002'
DMA2DCNTIE       EQU  H'0003'
DMA2ORIE         EQU  H'0004'
DMA2AIE          EQU  H'0005'
I2C2RXIE         EQU  H'0006'
I2C2TXIE         EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
I2C2IE           EQU  H'0000'
I2C2EIE          EQU  H'0001'
U2RXIE           EQU  H'0002'
U2TXIE           EQU  H'0003'
U2EIE            EQU  H'0004'
U2IE             EQU  H'0005'
TMR3IE           EQU  H'0006'
TMR3GIE          EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
TMR4IE           EQU  H'0000'
CCP2IE           EQU  H'0001'
CWG2IE           EQU  H'0003'
CLC2IE           EQU  H'0004'
INT2IE           EQU  H'0005'


;----- PIE8 Bits -----------------------------------------------------
TMR5IE           EQU  H'0006'
TMR5GIE          EQU  H'0007'


;----- PIE9 Bits -----------------------------------------------------
TMR6IE           EQU  H'0000'
CCP3IE           EQU  H'0001'
CWG3IE           EQU  H'0002'
CLC3IE           EQU  H'0003'


;----- PIE10 Bits -----------------------------------------------------
CCP4IE           EQU  H'0000'
CLC4IE           EQU  H'0001'


;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
HLVDIF           EQU  H'0001'
OSFIF            EQU  H'0002'
CSWIF            EQU  H'0003'
NVMIF            EQU  H'0004'
SCANIF           EQU  H'0005'
CRCIF            EQU  H'0006'
IOCIF            EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
DMA1SCNTIF       EQU  H'0000'
DMA1DCNTIF       EQU  H'0001'
DMA1ORIF         EQU  H'0002'
DMA1AIF          EQU  H'0003'
SPI1RXIF         EQU  H'0004'
SPI1TXIF         EQU  H'0005'
SPI1IF           EQU  H'0006'
I2C1RXIF         EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
I2C1TXIF         EQU  H'0000'
I2C1IF           EQU  H'0001'
I2C1EIF          EQU  H'0002'
U1RXIF           EQU  H'0003'
U1TXIF           EQU  H'0004'
U1EIF            EQU  H'0005'
U1IF             EQU  H'0006'
TMR0IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
TMR1IF           EQU  H'0000'
TMR1GIF          EQU  H'0001'
TMR2IF           EQU  H'0002'
CCP1IF           EQU  H'0003'
NCO1IF           EQU  H'0005'
CWG1IF           EQU  H'0006'
CLC1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
INT1IF           EQU  H'0000'
C2IF             EQU  H'0001'
DMA2SCNTIF       EQU  H'0002'
DMA2DCNTIF       EQU  H'0003'
DMA2ORIF         EQU  H'0004'
DMA2AIF          EQU  H'0005'
I2C2RXIF         EQU  H'0006'
I2C2TXIF         EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
I2C2IF           EQU  H'0000'
I2C2EIF          EQU  H'0001'
U2RXIF           EQU  H'0002'
U2TXIF           EQU  H'0003'
U2EIF            EQU  H'0004'
U2IF             EQU  H'0005'
TMR3IF           EQU  H'0006'
TMR3GIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
TMR4IF           EQU  H'0000'
CCP2IF           EQU  H'0001'
CWG2IF           EQU  H'0003'
CLC2IF           EQU  H'0004'
INT2IF           EQU  H'0005'


;----- PIR8 Bits -----------------------------------------------------
TMR5IF           EQU  H'0006'
TMR5GIF          EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
TMR6IF           EQU  H'0000'
CCP3IF           EQU  H'0001'
CWG3IF           EQU  H'0002'
CLC3IF           EQU  H'0003'


;----- PIR10 Bits -----------------------------------------------------
CCP4IF           EQU  H'0000'
CLC4IF           EQU  H'0001'


;----- PMD0 Bits -----------------------------------------------------
IOCMD            EQU  H'0000'
CLKRMD           EQU  H'0001'
NVMMD            EQU  H'0002'
SCANMD           EQU  H'0003'
CRCMD            EQU  H'0004'
HLVDMD           EQU  H'0005'
FVRMD            EQU  H'0006'
SYSCMD           EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
ZCDMD            EQU  H'0000'
CMP1MD           EQU  H'0001'
CMP2MD           EQU  H'0002'
ADCMD            EQU  H'0005'
DACMD            EQU  H'0006'


;----- PMD3 Bits -----------------------------------------------------
CCP1MD           EQU  H'0000'
CCP2MD           EQU  H'0001'
CCP3MD           EQU  H'0002'
CCP4MD           EQU  H'0003'
PWM5MD           EQU  H'0004'
PWM6MD           EQU  H'0005'
PWM7MD           EQU  H'0006'
PWM8MD           EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
CWG1MD           EQU  H'0005'
CWG2MD           EQU  H'0006'
CWG3MD           EQU  H'0007'


;----- PMD5 Bits -----------------------------------------------------
I2C1MD           EQU  H'0000'
I2C2MD           EQU  H'0001'
SPI1MD           EQU  H'0002'
U1MD             EQU  H'0004'
U2MD             EQU  H'0005'


;----- PMD6 Bits -----------------------------------------------------
DSMMD            EQU  H'0000'
CLC1MD           EQU  H'0001'
CLC2MD           EQU  H'0002'
CLC3MD           EQU  H'0003'
CLC4MD           EQU  H'0004'
SMT1MD           EQU  H'0005'


;----- PMD7 Bits -----------------------------------------------------
DMA1MD           EQU  H'0000'
DMA2MD           EQU  H'0001'


;----- BORCON Bits -----------------------------------------------------
BORRDY           EQU  H'0000'
SBOREN           EQU  H'0007'


;----- CPUDOZE Bits -----------------------------------------------------
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'

DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'


;----- OSCCON2 Bits -----------------------------------------------------
CDIV0            EQU  H'0000'
CDIV1            EQU  H'0001'
CDIV2            EQU  H'0002'
CDIV3            EQU  H'0003'
COSC0            EQU  H'0004'
COSC1            EQU  H'0005'
COSC2            EQU  H'0006'


;----- OSCCON3 Bits -----------------------------------------------------
NOSCR            EQU  H'0003'
ORDY             EQU  H'0004'
SOSCPWR          EQU  H'0006'
CSWHOLD          EQU  H'0007'


;----- OSCSTAT Bits -----------------------------------------------------
PLLR             EQU  H'0000'
ADOR             EQU  H'0002'
SOR              EQU  H'0003'
LFOR             EQU  H'0004'
MFOR             EQU  H'0005'
HFOR             EQU  H'0006'
EXTOR            EQU  H'0007'


;----- OSCSTAT1 Bits -----------------------------------------------------
PLLR             EQU  H'0000'
ADOR             EQU  H'0002'
SOR              EQU  H'0003'
LFOR             EQU  H'0004'
MFOR             EQU  H'0005'
HFOR             EQU  H'0006'
EXTOR            EQU  H'0007'


